#include "edit.h"

// グローバル変数宣言
EDITMANAGER g_editmane;	// エディター管理

//********************************************************
// エディター初期化
//********************************************************
void InitEdit()
{
	g_editmane.mode = EDITMODE_NONE;
	g_editmane.nCntTimer = 0;
}

//********************************************************
// エディターモード設定
//********************************************************
void SetEditMode(EDITMODE mode)
{
	g_editmane.mode = mode;
}

//********************************************************
// エディターモード取得
//********************************************************
EDITMODE GetEditMode(void)
{
	return g_editmane.mode;
}